Revit 2027 API
ConduitSizeSettings.GetSizeCount Method
 Gets the size count of the conduit size table. The conduit standard name the location of the size in the size table.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSizeCount(
	string standardName
)
Public Function GetSizeCount (
	standardName As String
) As Integer
public:
int GetSizeCount(
	String^ standardName
)
member GetSizeCount :
        standardName : string -> int
Parameters
standardName String
 The conduit standard name.
Return Value
Int32
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace